<?php

$lang = (object)[
    'kurtki' => 'Куртки, пальто',
    'rubaha' => 'Рубашки, футболки, джемперы',
    'bruki' => 'Брюки, джинсы',
    'kostum' => 'Костюмы',
    'obuv_m' => 'Обувь, носки',
    'perchatki' => 'Перчатки',
    'Обхват_груди' => 'Обхват груди',
    'Обхват_пояса' => 'Обхват пояса',
    'Международный_размер' => 'Международный размер',
    'Украинский_размер' => 'Украинский размер',
    'Обхват_бедер' => 'Обхват бедер',
    'Длина_стопы' => 'Длина стопы',
    'Длина_стельки' => 'Длина стельки',
    'Размер/обхват ладони_(дюймы)' => 'Размер/обхват ладони (дюймы)',
    'Обхват_ладони' => 'Обхват ладони',
    '' => '',
    '' => '',
    '' => '',
];
