<h1>Подтверждение изменения Email на сайте red.ua</h1>
<p style="font-size: 13px;">Ваша заявка на изменение email была успешно отправлена. На Ваш новый e-mail(<?php echo $this->email; ?>) придет письмо(<span style="color:red;">проверяйте спам</span>). Перейдите по ссылке для подтверждения изменения и активности Вашего нового email. <span style="font-weight: bold;">После подтверджения Email, также изменится Ваш логин для входа в личный кабинет, он будет соответствовать Вашему новому Email!</span></br>
<span style="color:red; font-weight: bold;  font-size: 13px;">Обратите внимание, если Вы не подтвердите свой новый email, он не будет активирован, Вы не сможете получать на него письма с нашего магазина.</span>
</p>

