/**
 * @author Melnaron
 */

// russian (ru)

var lang = {
	
	// welcome message
	1000: 'Добро пожаловать в RED.Chat! Используйте команду /help для просмотра всех доступных для вас команд.',
	
	// browser check message
	1010: 
		'Ваш браузер не совместим с этим веб-приложением.\n\n'+
		'Пожалуйста, установите совместимый браузер, такой как лучший в мире браузер - Firefox.\n\n'+
		'Хотите открыть страницу загрузки Firefox?',
	
	// help (0) guest
	1050: 
		'<p class="t">Вы можете использовать следующие команды:</p>'+
		'<p><strong>/help</strong> - посмотреть доступные команды.</p>'+
		'<p><strong>/motd</strong> - посмотреть сообщение дня.</p>'+
		'<p><strong>/nick (nickname)</strong> - сменить имя.</p>'+
		'<p><strong>/whisper (nickname) (message)</strong> - отправить приватное сообщение.</p>'+
		'<p><strong>/reg (password)</strong> - зарегистрировать ваше имя.</p>',
	
	// help (1) user
	1051: 
		'<p><strong>/password (password) (new password)</strong> - смена пароля.</p>'+
		'<p><strong>/unreg (password)</strong> - прекратить регистрацию.</p>',
	
	// help (2) operator
	1052: 
		'<p><strong>/motd (message)</strong> - установить сообщение дня.</p>'+
		'<p><strong>/motd clear</strong> - стереть сообщение дня.</p>'+
		'<p><strong>/echo (message)</strong> - опубликовать глобальное сообщение.</p>'+
		'<p><strong>/messages</strong> - посмотреть лог сообщений.</p>'+
		'<p><strong>/users</strong> - посмотреть пользователей.</p>'+
		'<p><strong>/bans</strong> - посмотреть баны.</p>'+
		'<p><strong>/kick (nickname)</strong> - выкинуть пользователя из чата.</p>'+
		'<p><strong>/ban (nickname)</strong> - добавить имя пользователя в бан.</p>'+
		'<p><strong>/unban (nickname)</strong> - удалить имя пользователя из бана.</p>'+
		'<p><strong>/banip (ip address)</strong> - добавить ip-адрес пользователя в бан.</p>'+
		'<p><strong>/unbanip (ip address)</strong> - удалить ip-адрес пользователя из бана.</p>'+
		'<p><strong>/silence (nickname) (minutes)</strong> - включить пользователю молчание на указанное количество минут.</p>',
	
	// help (3) administrator
	1053: 
		'<p><strong>/messages clear</strong> - очистить лог сообщений.</p>'+
		'<p><strong>/op (nickname)</strong> - дать пользователю доступ оператора.</p>'+
		'<p><strong>/unop (nickname)</strong> - убрать у пользователя доступ оператора.</p>',
	
	// user fields
	1101: 'ID',
	1102: 'Имя',
	1103: 'Пароль',
	1104: 'Доступ',
	1105: 'Статус',
	1106: 'IP',
	1107: 'Браузер',
	1108: 'Время соединения',
	1109: 'Время регистрации',
	1110: 'Аватар',
	1111: 'Email',
	1112: 'Репутация',
	1113: 'Описание',
	
	// common words
	1201: 'Copyright',
	1202: 'Версия',
	1203: 'Сообщений', 	// Messages: 3
	1204: 'Пользователей', 		// Users: 3
	1205: 'Банов', 		// Bans: 3
	1206: 'Имена',
	1207: 'IP-адреса',
	1208: 'С паролем',
	1209: 'Войти',
	1210: 'Соединение...',
	1211: 'Выбирите статус',
	
	// main buttons tooltips
	2001: 'Отправить сообщение',
	2002: 'Очистить сообщение',
	2003: 'Показать/спрятать смайлики',
	2004: 'Отключить/включить звуки',
	2005: 'Очистить лог сообщений',
	2006: 'О чате',
	2007: 'Выйти из чата',
	
	// language tooltips
	2201: 'Русский',
	2202: 'Английский',
	
	// statuses
	3000: 'Онлайн',
	3001: 'Отошел',
	3002: 'Занят',
	3003: 'Невидимый',
	
	// windows headers
	4010: 'Окно без названия',
	4011: 'О чате',
	4012: 'Ошибка',
	4013: 'Помощь',
	4014: 'Сообщения',
	4015: 'Пользователи',
	4016: 'Баны',
	
	// system messages
	5001: 'Сообщение Дня: %0',
	5002: 'Сообщение Дня не установлено.',
	5003: 'Сообщение Дня успешно стерто.',
	5004: 'Сообщение Дня успешно установлено.',
	5011: '%0 вошел(а) в чат.',
	5012: '%0 вышел(а) из чата.',
	5013: '%0 вышел(а) из чата по таймауту.',
	5014: '%0 был(а) выкинут(а) из чата.',
	5015: '%0 теперь известен(а) как %1.',
	5016: 'Теперь ваше имя %0.',
	5017: 'Вы зарегистрировались как администратор.',
	5018: 'Вы зарегистрировались.',
	5019: 'Ваш пароль был изменен.',
	5020: 'Вы успешно прекратили регистрацию.',
	5021: 'Лог сообщений был успешно очищен.',
	5022: '%0 сейчас будет выкинут(а) из чата.',
	5023: 'Имя (%0) добавлено в бан.',
	5024: 'Имя (%0) удалено из бана.',
	5025: 'Ip-адрес (%0) добавлен в бан.',
	5026: 'Ip-адрес (%0) удален из бана.',
	5027: 'Пользователю %0 включено молчание на %1 минут(у).',
	5028: 'Вы были повышены до оператора.',
	5029: '%0 был(а) повышен(а) до оператора.',
	5030: 'Вы были понижены до пользователя.',
	5031: '%0 был(а) понижен(а) до пользователя.',
	
	// error messages
	6001: 'Соединение прервано.',
	6002: 'Сервер не найден (404).',
	6003: 'Вы должны ввести имя.',
	6004: 'Вы уже соединены.',
	6005: 'Гости не могут войти в чат.',
	6006: 'Не возможно создать базу данных.',
	6007: 'Не возможно соединиться с базой данных.',
	6011: 'Неправильное имя. Вы можете использовать только следующие символы: A-z А-я . - _',
	6012: 'Неправильное имя. Оно должно быть от 2 до 16 символов в длину.',
	6013: 'Вы не можете войти в чат пока ваше имя или ip-адрес забанены.',
	6014: 'Неправильный пароль.',
	6015: 'Такое имя уже используется.',
	6016: 'Ошибка базы-данных.',
	6017: 'У вас нет доступа для использования этой команды.',
	6018: 'Вы выкинуты из чата.',
	6019: 'Вы не можете ничего отправлять в чат пока у вас включено молчание. Осталось минут: %0.',
	6020: 'Неизвестная команда.',
	6021: 'Вы не можете шептать себе.',
	6022: 'Пользователь с таким именем не найден.',
	6023: 'Вы должны ввести сообщение.',
	6024: 'Вы уже зарегистрированы.',
	6025: 'Вы должны ввести пароль.',
	6026: 'Ваш пароль не может содержать пробелы.',
	6027: 'Вы должны ввести старый и новый пароль.',
	6028: 'Старый пароль неправильный.',
	6029: 'Операторы или администраторы не могут прекратить регистрацию.',
	6030: 'Вы должны ввести ваш правильный пароль.',
	6031: 'Введите имя пользователя которого вы хотите выкинуть из чата.',
	6032: 'Вы должны ввести корректное время в минутах.',
	6033: 'Вы не можете включить молчание у себя.',
	6034: 'Вы можете использовать эту команду только на пользователей уровень доступа которых ниже вашего.',
	6035: 'Вам было включено молчание на %0 минут(у).',
	6036: '',
	6037: 'Только пользователь может быть повышен до оператора.',
	6038: 'Только оператор может быть понижен до пользователя.',
	6039: 'Вы не можете добавить это имя в бан.',
	6040: 'Вы не можете добавить этот ip-адрес в бан.',
	
	9999: ''
	
};