<div class="card text-center  m-auto  col-12">
  <div class="card-body ">
    <h5 class="card-title text-uppercase ">Уважаемые покупатели!</h5>
    <p class="card-text" style="font-size:1rem;text-align: justify;line-height: 2;">
        В связи с форс-мажорными обстоятельствами, обусловленными пандемией вируса Covid-19 в мире и его распространением в Украине и учитывая введение карантина на территории всей Украины, установленного Постановлением Кабинета Министров Украины # 211 от 11.03.2020 года, нашей Компанией принято решение о временных ограничениях в режиме работы.
Указанные ограничения заключаются в предоставлении отпусков работникам и переводе некоторых работников на дистанционную работу, а также установление ограниченного режима рабочего времени. Ограничения будут действовать в течение срока карантина. Учитывая это, просим Вас учитывать возможные задержки в подтверждениях заказов и их отправке. С учетом вышеперечисленного, отправка посылок будет осуществляться в срок 3-5 дней с момента оформления.
Также просим Вас отнестись с пониманием к возможным сбоям в работе сайта и службы поддержки. Служба поддержки будет работать только по электронной почте market@red.ua.
В любом случае, все заказы и наши обязательства будут осуществлены в ближайшее время после завершения карантина.
<br><br>
Будьте здоровы,<br>
Администрация RED.ua</p>
  </div>
</div>

